[
  {
    "stage_number": 0,
    "title": "Rob lives in isolation",
    "description": "Rob lives alone with his pig in a remote part of the Oregon wilderness. Besides routine visits from Amir, his truffle buyer, Rob has little contact with the outside world. He often listens to voice message recordings of his late wife on his tape player.",
    "time": "00:05:27"
  },
  {
    "stage_number": 1,
    "title": "Amir offers Rob elements of the outside world",
    "description": "Amir offers Rob several items from the world he left behind, including a camping shower, propane, and even a phone.",
    "time": "00:07:23"
  },
  {
    "stage_number": 2,
    "title": "Rob refuses Amir's offer",
    "description": "Without speaking a word, Rob refuses Amir's offers of connection to the outside world. He takes the fews supplies he did need from Amir and closes the door.",
    "time": "00:07:37"
  },
  {
    "stage_number": 3,
    "title": "Rob uses phone at Diner",
    "description": "Rob visits a nearby diner looking for \"Marge\". When the waitress there tells him that Marge no longer works there, Rob asks to use her phone. The waitress hesitantly agrees, providing him with support from a world beyond his own when the story first began.",
    "time": "00:15:58"
  },
  {
    "stage_number": 4,
    "title": "Rob reaches out to Amir",
    "description": "Rob uses the phone to Contact Amir, knowing that Amir will use his car, his phone and his other implements from the world that Rob had originally intended to leave behind.",
    "time": "00:16:00"
  },
  {
    "stage_number": 5,
    "title": "Rob rides in Amir's Camaro",
    "description": "Rob gets into Amir's car, a stark contrast to his simple life in the wilderness. At this moment, he is fully at the mercy of the outside world, specifically Amir.",
    "time": "00:16:38"
  },
  {
    "stage_number": 6,
    "title": "Rob turns off Amir's podcast",
    "description": "Though a brief moment, Rob expresses frustration and rejection of this new world as he attempts to shut off Amir's podcast about classical music.",
    "time": "00:16:47"
  },
  {
    "stage_number": 7,
    "title": "Mac takes up Rob's cause",
    "description": "Amir brings Rob to a head truffle seller named Mac, who immediately validates Rob's concern for his pig. She shows her \"love\" by taking up Rob's anger and frustration with those who have wronged him, and by bringing him and Amir directly to the home of those responsible.",
    "time": "00:18:42"
  },
  {
    "stage_number": 8,
    "title": "Darius tries to buy off Rob",
    "description": "Rob finally meets Darius, the person who orchestrated the theft, and also Amir's cold, distant father. Darius attempts to \"bribe\" Rob into ending his quest in exchange for increasingly large sums of money, all of which Rob refuses.",
    "time": "00:59:40"
  },
  {
    "stage_number": 9,
    "title": "Darius refuses to return the Pig",
    "description": "When Rob refuses to accept the money, Darius still refuses to return the pig. At first, this moment is an initial defeat for Rob - he has confirmed who stole his pig, who has it now, and that there is no way of getting her back.",
    "time": "01:00:23"
  },
  {
    "stage_number": 10,
    "title": "Rob acknowledges his love",
    "description": "Rob admits to Amir that he doesn't actually need his pig for finding truffles, he simply loves the animal. In this moment, Rob achieves a deeper level of personal insight, as he finally acknowledges his emotional connection to another living being.",
    "time": "01:02:49"
  },
  {
    "stage_number": 11,
    "title": "Darius' tears over dinner",
    "description": "Darius shows his emotions when Rob and Amir prepare a meal for him that is so satisfying and evocative that he is moved to tears. In this moment, Rob and Amir overcome Darius' cold, harsh outlook on life through a basic act of compassion. Following this moment, Darius reveals that Rob's pig has died. While Rob is devastated, he achieves the closure he set on his quest to achieve.",
    "time": "01:13:48"
  },
  {
    "stage_number": 12,
    "title": "Rob and Amir go to the diner",
    "description": "Instead of Rob returning back home, he and Amir go to the diner together - the same one from which he originally made the call to Amir.",
    "time": "01:18:49"
  },
  {
    "stage_number": 13,
    "title": "Rob forgives",
    "description": "During their meal, Rob mentions that if he hadn't gone on his quest to get his pig back, she would still be alive in his mind. Amir refutes this point, and Rob appears to agree, albeit silently. They end the meal with the agreement to continue doing business together. In this moment, Rob has traveled to a state of complete forgiveness for Amir and acceptance of his loss.",
    "time": "01:21:38"
  },
  {
    "stage_number": 14,
    "title": "Rob washes his face",
    "description": "As Rob returns to the wilderness, he stops at a river to wash. Until this point, his face was covered in blood from many acts of violence, including the original attack during which his pig was taken. In this moment, Rob is rescued by nature from the trauma of his past.",
    "time": "01:23:27"
  },
  {
    "stage_number": 15,
    "title": "Rob returns home",
    "description": "Rob walks back to his remote home in the wilderness. During his journey, he came to terms with the loss of his pig, but also the earlier loss of his wife.",
    "time": "01:25:23"
  },
  {
    "stage_number": 16,
    "title": "Rob listens to his wife's music",
    "description": "Instead of listening to his wife's voice recordings, Rob now uses the device to listen to her play music. This shows that Rob has learned to cherish the loving memories he has of his wife, while also accepting that she is gone.",
    "time": "01:25:30"
  },
  {
    "stage_number": 17,
    "title": "Rob lives on",
    "description": "While listening to his wife, Rob looks at his pig's empty bed, then stares up, assumably to the heavens while thinking about them both. He is now able to live back in his original home, with a new sense of acceptance and peace.",
    "time": "01:27:05"
  }
]
