[
  {
    "stage_number": 0,
    "description": "Deloris Wilson (Deloris Van Cartier) is a lounge singer in Reno, Nevada, in a club owned by her married gangster boyfriend Vince LaRocca."
  },
  {
    "stage_number": 1,
    "description": "Deloris witnesses a crime committed by Vince LaRocca and is placed in witness protection. She is relocated to a convent in San Francisco, where she must pose as a nun."
  },
  {
    "stage_number": 2,
    "description": "Deloris struggles to adapt to life in the convent and clashes with the strict Mother Superior. She also finds it difficult to fit in with the other nuns."
  },
  {
    "stage_number": 3,
    "description": "Sister Mary Patrick offers kindness to Deloris when she first arrives by offering her friendship and support."
  },
  {
    "stage_number": 4,
    "description": "Deloris discovers the convent's choir, which is in disarray, and decides to take charge and revitalize it using her musical talents."
  },
  {
    "stage_number": 5,
    "description": "Deloris tries to sneak out of the convent to perform at a nightclub, but is caught by Mother Superior. This leads to a confrontation where Deloris expresses her desire to help the choir."
  },
  {
    "stage_number": 6,
    "description": "Deloris successfully revitalizes the choir, bringing new energy and attracting attention to the convent."
  },
  {
    "stage_number": 7,
    "description": "The choir's success helps to improve the convent's reputation and brings the community together."
  },
  {
    "stage_number": 8,
    "description": "Deloris faces challenges as she balances her new life in the convent with her past, but she remains determined to keep the choir thriving."
  },
  {
    "stage_number": 9,
    "description": "The choir prepares for a big performance that could secure the future of the convent."
  },
  {
    "stage_number": 10,
    "description": "The big performance takes place, showcasing the choir's talent and bringing hope to the convent."
  },
  {
    "stage_number": 11,
    "description": "Deloris's past catches up with her, putting the convent and choir in danger."
  },
  {
    "stage_number": 12,
    "description": "Deloris and the nuns work together to protect the convent and ensure the choir's future."
  },
  {
    "stage_number": 13,
    "description": "The convent faces a crisis as authorities investigate the threats against it."
  },
  {
    "stage_number": 14,
    "description": "Deloris and the nuns rally the community to support the convent and its mission."
  },
  {
    "stage_number": 15,
    "description": "The community comes together to support the convent, strengthening its resolve."
  },
  {
    "stage_number": 16,
    "description": "Deloris and the nuns prepare for the final challenges ahead, united and hopeful."
  },
  {
    "stage_number": 17,
    "description": "The story concludes with the convent and choir overcoming their challenges, celebrating their unity and success."
  }
]
