[
  {
    "stage_number": 0,
    "title": "Deloris' life in Reno",
    "description": "Deloris Wilson (Deloris Van Cartier) is a lounge singer in Reno, Nevada, in a club owned by her married mafia boss boyfriend Vince LaRocca. While she excels at her craft, she struggles with several aspects of her current world, including Vince's non-committal mentality as well as her frustration with her fellow performers.",
    "time": "00:03:57"
  },
  {
    "stage_number": 1,
    "title": "Lieutenant Souther offers witness protection",
    "description": "After Deloris witnesses a murder at the hands of Willy and Joey, Vince's henchmen, Police Lieutenant Eddie Souther offers to place her into a witness protection program if she agrees to testify against him. While this offers Deloris a chance at redemption and revenge against the story's antagonist (Vince) it also puts her in immediate danger.",
    "time": "00:15:53"
  },
  {
    "stage_number": 2,
    "title": "Deloris refuses to join the convent",
    "description": "Feeling rejected and unwanted by the Reverend Mother of St. Katherine's, Deloris refuses to join the community of nuns.",
    "time": "00:18:40"
  },
  {
    "stage_number": 3,
    "title": "Deloris dons her habit",
    "description": "Reverend Mother gives Deloris her formal clothes to wear in her new life as a nun. While she's unhappy to wear them, the clothing provides her with a sense of belonging in her community as well as protection from her dangerous past.",
    "time": "00:21:47"
  },
  {
    "stage_number": 4,
    "title": "Deloris becomes Sr. Mary Clarence",
    "description": "After reconciling with Reverend Mother, Deloris is given her new name as a nun: Sister Mary Clarence. Both Deloris and Reverend Mother proceed to the dining hall so that Deloris / Sr. Mary Clarence can meet the other nuns and begin her new life.",
    "time": "00:22:36"
  },
  {
    "stage_number": 5,
    "title": "Deloris' first meal in the convent",
    "description": "Deloris has her first meal in the convent's dining hall with the other nuns. While she detests the food at first, she learns to accept it as part of her new life and community.",
    "time": "00:25:00"
  },
  {
    "stage_number": 6,
    "title": "Deloris struggles with nun life",
    "description": "While Deloris attempts to adapt to her new life as a nun, she struggles with the labor-intensive lifestyle, as well as the strict rules and expectations of the convent. She feels out of place and longs for her old life. She pleads with Lieutenant Souther to let her leave, but he insists that she stay for her own safety.",
    "time": "00:36:12"
  },
  {
    "stage_number": 7,
    "title": "Sister Mary Robert gifts an alarm clock",
    "description": "Novice Sister Mary Robert gifts a flower-shaped alarm clock to Deloris to help her adapt to her new community by waking up early, which is something she struggles with during her transition into the convent. Deloris sincerely accepts the gift, and forms a bond with Sr. Mary Robert during the ensuing conversation.",
    "time": "00:38:23"
  },
  {
    "stage_number": 8,
    "title": "Deloris sneaks away to a nearby bar",
    "description": "Deloris seeks escape from the convent at a nearby bar. While she begins to fall back into her old ways, sisters Mary Robert and Mary Patrick follow her and unintentionally rescue her from falling back into her old world.",
    "time": "00:41:50"
  },
  {
    "stage_number": 9,
    "title": "Vince captures Deloris",
    "description": "After capturing Deloris, Vince confronts her about her betrayal, and tries to convince her that his intentions were always good, despite his sinful, violent actions. Deloris rejects his attempts at manipulation, and expresses only loving forgiveness and compassion.",
    "time": "01:23:36"
  },
  {
    "stage_number": 10,
    "title": "Deloris shows insight to Willy and Joey",
    "description": "Deloris uses the power of truth to convince Willy and Joey to refrain from killing her. She prays that they will see the true cowardice in Vince, and that they have the choice to refrain from following his orders, and to spare her life. In this moment, Deloris displays a profound understanding of herself and others.",
    "time": "01:25:45"
  },
  {
    "stage_number": 11,
    "title": "Deloris overcomes Vince's violence",
    "description": "Empowered by her new-found community and sense of self-worth, Deloris is able not only to overcome Vince's threat of violence, but also help in his capture by the authorities.",
    "time": "01:31:59"
  },
  {
    "stage_number": 12,
    "title": "Deloris refuses to curse",
    "description": "Once Vince is taken into custody, Deloris begins to speak, and the other sisters suspect she may say angry, unholy words towards him, thus showing her relapse into her previous world. Instead, she simply says \"Bless You\", thus demonstrating her refusal of her former self.",
    "time": "01:32:07"
  },
  {
    "stage_number": 13,
    "title": "Reverend Mother discusses Deloris' impact",
    "description": "After the threat of Vince's violence has passed, Reverend Mother initiates a discussion with Deloris about the impact her presence has had on the convent and its community. Thus, the focus of Deloris' journey shifts from self-preservation to considering the negative impact she may have had on the religious community.",
    "time": "01:32:18"
  },
  {
    "stage_number": 14,
    "title": "Reverend Mother praises Deloris",
    "description": "Instead of showing contempt, Reverend Mother expresses appreciation for the positive impact Deloris has had on the convent and its community. In so doing, Reverend Mother allows Deloris to break the chain of hurt and revenge that has defined her previous life, and thus she is able to escape into a new life of forgiveness and self-fulfillment.",
    "time": "01:32:25"
  },
  {
    "stage_number": 15,
    "title": "Deloris confirms her true identity",
    "description": "Deloris openly discusses her true identity with the nuns, thus initiating her return to her former self.",
    "time": "01:32:58"
  },
  {
    "stage_number": 16,
    "title": "Concert for the Pope",
    "description": "Deloris and the nuns perform a concert for the Pope, each in their authentic, true selves. While Deloris wears most of her old habit clothing, she lets her hair out freely, showing her embodiment of both her new and old self.",
    "time": "01:36:09"
  },
  {
    "stage_number": 17,
    "title": "Deloris' new life outside the convent",
    "description": "During the credits, Deloris is shown to have embraced her new life outside the convent, while still maintaining her connection to her community of nuns.",
    "time": "01:36:53"
  }
]
